RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/drivers/fsl_puf_v3.c
/*
 * Copyright 2020 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_common.h"
#include "fsl_puf_v3.h"
#include "fsl_clock.h"
#include "fsl_reset.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.puf_v3"
#endif

#define kPUF_OperationInProgress (0x0u)
#define kPUF_Enroll              (0x1u)
#define kPUF_Start               (0x2u)
#define kPUF_Stop                (0x5u)
#define kPUF_GetKey              (0x6u)
#define kPUF_Unwrap              (0x7u)
#define kPUF_WrapGeneratedRandom (0x8u)
#define kPUF_Wrap                (0x9u)
#define kPUF_GenerateRandom      (0xfu)
#define kPUF_Test                (0x1fu)
#define kPUF_Init                (0x20u)
#define kPUF_Zeroize             (0x2fu)
typedef uint32_t puf_last_operation_t;

#define PUF_KEY_OPERATION_CONTEXT_TYPE (0x10 << 16)
#define PUF_CONTEXT_GENERIC_KEY_TYPE   (0x0u)
#define PUF_CONTEXT_KEY_LEN_MASK       (0x1fffu)

/*******************************************************************************
 * Code
 ******************************************************************************/

static status_t puf_waitForInit(PUF_Type *base)
{
    status_t status = kStatus_Fail;

    /* wait until status register reads non-zero. All zero is not valid. It should be BUSY or OK or ERROR */
    while (0u == base->SR)
    {
    }

    /* wait if busy */
    while ((base->SR & PUF_SR_BUSY_MASK) != 0u)
    {
    }

    /* return status */
    if (base->SR & (PUF_SR_OK_MASK | PUF_SR_ERROR_MASK))
    {
        status = kStatus_Success;
    }

    return status;
}

static void puf_powerOn(PUF_Type *base, puf_config_t *conf)
{
    /* Power On PUF SRAM */
    base->SRAM_CFG = 0x1u;
    while (0u == (PUF_SRAM_STATUS_READY_MASK & base->SRAM_STATUS))
    {
    }
}

static status_t puf_powerCycle(PUF_Type *base, puf_config_t *conf)
{
    /* Power off */
    base->SRAM_CFG = 0x0u;

    /* Reset PUF and reenable power to PUF SRAM */
    RESET_PeripheralReset(kPUF_RST_SHIFT_RSTn);
    puf_powerOn(base, conf);

    return kStatus_Success;
}

static status_t puf_makeStatus(PUF_Type *base, puf_last_operation_t operation)
{
    uint32_t result;
    status_t status = kStatus_Fail;

    if (((base->ORR & PUF_ORR_LAST_OPERATION_MASK) >> PUF_ORR_LAST_OPERATION_SHIFT) == operation)
    {
        result = (base->ORR & PUF_ORR_RESULT_CODE_MASK);
        if ((result == kPUF_ResultOK) && (0u == (base->SR & PUF_SR_ERROR_MASK)))
        {
            status = kStatus_Success;
        }
        else
        {
            status = MAKE_STATUS(kStatusGroup_PUF, result);
        }
    }

    return status;
}

/*!
 * brief Sets the default configuration of PUF
 *
 * This function initialize PUF config structure to default values.
 *
 * @param conf PUF configuration structure
 */
void PUF_GetDefaultConfig(puf_config_t *conf)
{
    /* Default configuration after reset */
    conf->dataEndianness = kPUF_EndianBig;
    conf->CKGATING       = 0U;
}

/*!
 * brief Initialize PUF
 *
 * This function enables power to PUF block and waits until the block initializes.
 *
 * @param conf PUF configuration structure
 * @return Status of the init operation
 */
status_t PUF_Init(PUF_Type *base, puf_config_t *conf)
{
    status_t status = kStatus_Fail;

    /* Enable PUF clock */
    CLOCK_EnableClock(kCLOCK_Puf);
    /* Reset PUF */
    RESET_PeripheralReset(kPUF_RST_SHIFT_RSTn);

    /* Set configuration from SRAM */
    base->SRAM_CFG |= PUF_SRAM_CFG_CKGATING(conf->CKGATING);

    /* Enable power to PUF SRAM */
    puf_powerOn(base, conf);

    /* Wait for peripheral to become ready */
    status = puf_waitForInit(base);

    /* In case of error or enroll & start not allowed, do power-cycle */
    if ((status != kStatus_Success) || ((PUF_AR_ALLOW_ENROLL_MASK | PUF_AR_ALLOW_START_MASK) !=
                                        (base->AR & (PUF_AR_ALLOW_ENROLL_MASK | PUF_AR_ALLOW_START_MASK))))
    {
        puf_powerCycle(base, conf);
        status = puf_waitForInit(base);
    }

    if (kStatus_Success == status)
    {
        /* Set data endianness */
        base->MISC = PUF_MISC_DATA_ENDIANNESS(conf->dataEndianness);

        /* get status */
        status = puf_makeStatus(base, kPUF_Init);
    }

    return status;
}

/*!
 * brief Denitialize PUF
 *
 * This function disables power to PUF SRAM and peripheral clock.
 *
 * @param base PUF peripheral base address
 * @param conf PUF configuration structure
 */
void PUF_Deinit(PUF_Type *base, puf_config_t *conf)
{
    base->SRAM_CFG = 0x0u;

    RESET_SetPeripheralReset(kPUF_RST_SHIFT_RSTn);
    CLOCK_DisableClock(kCLOCK_Puf);
}

/*!
 * brief Enroll PUF
 *
 * This function derives a digital fingerprint, generates the corresponding Activation Code (AC)
 * and returns it to be stored in an NVM or a file. This step needs to be
 * performed only once for each device. This function may be permanently disallowed by a fuse.
 *
 * @param base PUF peripheral base address
 * @param[out] activationCode Word aligned address of the resulting activation code.
 * @param activationCodeSize Size of the activationCode buffer in bytes. Shall be 996 bytes.
 * @param score Value of the PUF Score that was obtained during the enroll operation.
 * @return Status of enroll operation.
 */
status_t PUF_Enroll(PUF_Type *base, uint8_t *activationCode, size_t activationCodeSize, uint8_t *score)
{
    status_t status                 = kStatus_Fail;
    uint32_t *activationCodeAligned = NULL;
    register uint32_t temp32        = 0;

    /* check that activation code buffer size is at least 996 bytes */
    if (activationCodeSize < PUF_ACTIVATION_CODE_SIZE)
    {
        return kStatus_InvalidArgument;
    }

    /* only work with aligned and valid activationCode */
    if ((0x3u & (uintptr_t)activationCode) || (activationCode == NULL))
    {
        return kStatus_InvalidArgument;
    }

    activationCodeAligned = (uint32_t *)(uintptr_t)activationCode;

    /* check if ENROLL is allowed */
    if (0x0u == (base->AR & PUF_AR_ALLOW_ENROLL_MASK))
    {
        return kStatus_PUF_OperationNotAllowed;
    }

