RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/drivers/fsl_puf_v3.c
    /* begin */
    base->CR = PUF_CR_ENROLL_MASK;

    /* wait till command is accepted */
    while (0u != (base->CR & PUF_CR_ENROLL_MASK))
    {
    }

    /* read out AC */
    while (0u != (base->SR & PUF_SR_BUSY_MASK))
    {
        if (0u != (PUF_SR_DO_REQUEST_MASK & base->SR))
        {
            temp32 = base->DOR;
            if (activationCodeSize >= sizeof(uint32_t))
            {
                *activationCodeAligned = temp32;
                activationCodeAligned++;
                activationCodeSize -= sizeof(uint32_t);
            }
        }
    }

    /* In case of success fill in score */
    if ((0u != (base->SR & PUF_SR_OK_MASK)) && (score != NULL))
    {
        *score = (uint8_t)(base->PSR & PUF_PSR_PUF_SCORE_MASK);
    }

    /* get status */
    status = puf_makeStatus(base, kPUF_Enroll);

    return status;
}

/*!
 * brief Start PUF
 *
 * The Activation Code generated during the Enroll operation is used to
 * reconstruct the digital fingerprint. This needs to be done after every power-up
 * and reset.
 *
 * @param base PUF peripheral base address
 * @param[in] activationCode Word aligned address of the input activation code.
 * @param activationCodeSize Size of the activationCode buffer in bytes. Shall be 996 bytes.
 * @param score Value of the PUF Score that was obtained during the start operation.
 * return Status of start operation.
 */
status_t PUF_Start(PUF_Type *base, const uint8_t *activationCode, size_t activationCodeSize, uint8_t *score)
{
    status_t status                       = kStatus_Fail;
    const uint32_t *activationCodeAligned = NULL;
    register uint32_t temp32              = 0;

    /* check that activation code size is at least 996 bytes */
    if (activationCodeSize < PUF_ACTIVATION_CODE_SIZE)
    {
        return kStatus_InvalidArgument;
    }

    /* Set activationCodeSize to 996 bytes */
    activationCodeSize = PUF_ACTIVATION_CODE_SIZE;

    /* only work with aligned activationCode */
    if (0x3u & (uintptr_t)activationCode)
    {
        return kStatus_InvalidArgument;
    }

    activationCodeAligned = (const uint32_t *)(uintptr_t)activationCode;

    /* check if START is allowed */
    if (0x0u == (base->AR & PUF_AR_ALLOW_START_MASK))
    {
        return kStatus_PUF_OperationNotAllowed;
    }

    /* begin */
    base->CR = PUF_CR_START_MASK;

    /* wait till command is accepted */
    while (0u != (base->CR & PUF_CR_START_MASK))
    {
    }

    /* while busy send AC */
    while (0u != (base->SR & PUF_SR_BUSY_MASK))
    {
        if (0u != (PUF_SR_DI_REQUEST_MASK & base->SR))
        {
            if (activationCodeSize >= sizeof(uint32_t))
            {
                temp32 = *activationCodeAligned;
                activationCodeAligned++;
                activationCodeSize -= sizeof(uint32_t);
            }
            /* Send AC again */
            else
            {
                activationCodeAligned = (const uint32_t *)(uintptr_t)activationCode;
                temp32                = *activationCodeAligned;
                activationCodeAligned++;
                activationCodeSize = PUF_ACTIVATION_CODE_SIZE - sizeof(uint32_t);
            }
            base->DIR = temp32;
        }
    }

    /* In case of success fill in score */
    if ((0u != (base->SR & PUF_SR_OK_MASK)) && (score != NULL))
    {
        *score = (uint8_t)(base->PSR & PUF_PSR_PUF_SCORE_MASK);
    }

    /* get status */
    status = puf_makeStatus(base, kPUF_Start);

    return status;
}

/*!
 * brief Stop PUF
 *
 * The Stop operation removes all key material from PUF flipflops and PUF SRAM, and sets
 * PUF to the Stopped state.
 *
 * @param base PUF peripheral base address
 * @return Status of stop operation.
 */
status_t PUF_Stop(PUF_Type *base)
{
    status_t status = kStatus_Fail;

    /* check if STOP is allowed */
    if (0x0u == (base->AR & PUF_AR_ALLOW_STOP_MASK))
    {
        return kStatus_PUF_OperationNotAllowed;
    }

    /* begin */
    base->CR = PUF_CR_STOP_MASK;

    /* wait till command is accepted */
    while (0u != (base->CR & PUF_CR_STOP_MASK))
    {
    }

    /* wait while busy */
    while (0u != (base->SR & PUF_SR_BUSY_MASK))
    {
    }

    /* get status */
    status = puf_makeStatus(base, kPUF_Stop);

    return status;
}

/*!
 * brief PUF Get Key
 *
 * The Get Key operation derives a key from the intrinsic PUF key and externally provided context.
 *
 * @param base PUF peripheral base address
 * @param keyCtx PUF key context struct
 * @param keyDest output destination of the derived PUF key
 * @param[out] key Word aligned address of output key (only used when kPUF_KeyDestRegister).
 * @param keySize Size of the derived key in bytes.
 * @return Status of get key operation.
 */
status_t PUF_GetKey(PUF_Type *base, puf_key_ctx_t *keyCtx, puf_key_dest_t keyDest, uint8_t *key, size_t keySize)
{
    uint8_t idx          = 0;
    uint32_t *keyAligned = NULL;
    uint32_t context[4]  = {0};
    status_t status      = kStatus_Fail;

    /* check if GET KEY is allowed */
    if (0x0u == (base->AR & PUF_AR_ALLOW_GET_KEY_MASK))
    {
        return kStatus_PUF_OperationNotAllowed;
    }

    /* check for key context */
    if (keyCtx == NULL)
    {
        return kStatus_InvalidArgument;
    }

    /* check for valid key destination */
    if (((keyDest == kPUF_KeyDestRegister) && (key == NULL)) || (keyDest == kPUF_KeyDestInvalid))
    {
        return kStatus_InvalidArgument;
    }

    /* check for valid key size. */
    /* must be 8byte multiple */
    if (keySize & 0x7u)
    {
        return kStatus_InvalidArgument;
    }
    /* if keySize > 128bytes, it must be equal to 256bytes or 384bytes or 512bytes */
    else if ((keySize > 128u) && !((keySize == 256u) || (keySize == 384u) || (keySize == 512u)))
    {
        return kStatus_InvalidArgument;
    }

    /* only work with aligned key */
    if (0x3u & (uintptr_t)key)
    {
        return kStatus_InvalidArgument;
    }

    keyAligned = (uint32_t *)(uintptr_t)key;

    /* fill in key context */
    context[0] = PUF_KEY_OPERATION_CONTEXT_TYPE | ((keySize * 8u) & PUF_CONTEXT_KEY_LEN_MASK);
    context[1] = PUF_CONTEXT_GENERIC_KEY_TYPE | (keyCtx->keyScopeStarted << 8u) | keyCtx->keyScopeEnrolled;
    context[2] = keyCtx->userCtx0;
    context[3] = keyCtx->userCtx1;

    /* set key destination */
    base->KEY_DEST = keyDest;

