RT-Thread/rt-thread/bsp/lpc55sxx/Libraries/LPC55S36/LPC55S36/drivers/fsl_puf_v3.c
    /* begin */
    base->CR = PUF_CR_GET_KEY_MASK;

    /* wait till command is accepted */
    while (0u != (base->CR & PUF_CR_GET_KEY_MASK))
    {
    }

    /* send context and read output data while busy */
    while (0 != (base->SR & PUF_SR_BUSY_MASK))
    {
        if ((0 != (PUF_SR_DI_REQUEST_MASK & base->SR)) && (idx < 4u))
        {
            base->DIR = context[idx];
            idx++;
        }

        if ((0 != (PUF_SR_DO_REQUEST_MASK & base->SR)) && (kPUF_KeyDestRegister == keyDest))
        {
            if (keySize >= sizeof(uint32_t))
            {
                *keyAligned = base->DOR;
                keyAligned++;
                keySize -= sizeof(uint32_t);
            }
        }
    }

    /* get status */
    status = puf_makeStatus(base, kPUF_GetKey);

    return status;
}

/*!
 * brief PUF Wrap generated random
 *
 * The Wrap Generated Random operation wraps a random key into a Key Code (KC).
 *
 * @param base PUF peripheral base address
 * @param keyCtx PUF key context struct
 * @param keySize Size of the key to be generated in bytes.
 * @param[out] keyCode Word aligned address of the resulting key code.
 * @param keyCodeSize Size of the output keycode in bytes.
 * @return Status of wrap generated random operation.
 */
status_t PUF_WrapGeneratedRandom(
    PUF_Type *base, puf_key_ctx_t *keyCtx, size_t keySize, uint8_t *keyCode, size_t keyCodeSize)
{
    uint8_t idx              = 0;
    uint32_t *keyCodeAligned = NULL;
    uint32_t context[4]      = {0};
    status_t status          = kStatus_Fail;

    /* check if WRAP GENERATED RANDOM is allowed */
    if (0x0u == (base->AR & PUF_AR_ALLOW_WRAP_GENERATED_RANDOM_MASK))
    {
        return kStatus_PUF_OperationNotAllowed;
    }

    /* check for valid key context and keyCode buffer */
    if ((keyCtx == NULL) || (keyCode == NULL))
    {
        return kStatus_InvalidArgument;
    }

    /* check for valid key size. */
    /* must be 8byte multiple */
    if (keySize & 0x7u)
    {
        return kStatus_InvalidArgument;
    }
    /* if keySize > 128bytes, it must be equal to 256bytes or 384bytes or 512bytes */
    else if ((keySize > 128u) && !((keySize == 256u) || (keySize == 384u) || (keySize == 512u)))
    {
        return kStatus_InvalidArgument;
    }

    /* check that keyCodeSize is correct for given keySize */
    if (keyCodeSize < PUF_GET_KEY_CODE_SIZE_FOR_KEY_SIZE(keySize))
    {
        return kStatus_InvalidArgument;
    }

    /* only work with aligned key code */
    if (0x3u & (uintptr_t)keyCode)
    {
        return kStatus_InvalidArgument;
    }

    keyCodeAligned = (uint32_t *)(uintptr_t)keyCode;

    /* fill in key context */
    context[0] = PUF_KEY_OPERATION_CONTEXT_TYPE | ((keySize * 8u) & 0x1FFF);
    context[1] = PUF_CONTEXT_GENERIC_KEY_TYPE | (keyCtx->keyScopeStarted << 8u) | keyCtx->keyScopeEnrolled;
    context[2] = keyCtx->userCtx0;
    context[3] = keyCtx->userCtx1;

    /* begin */
    base->CR = PUF_CR_WRAP_GENERATED_RANDOM_MASK;

    /* wait till command is accepted */
    while (0u != (base->CR & PUF_CR_WRAP_GENERATED_RANDOM_MASK))
    {
    }

    /* send context and read output data while busy */
    while (0u != (base->SR & PUF_SR_BUSY_MASK))
    {
        if ((0u != (PUF_SR_DI_REQUEST_MASK & base->SR)) && (idx < 4u))
        {
            base->DIR = context[idx];
            idx++;
        }

        if (0u != (PUF_SR_DO_REQUEST_MASK & base->SR))
        {
            if (keyCodeSize >= sizeof(uint32_t))
            {
                *keyCodeAligned = base->DOR;
                keyCodeAligned++;
                keyCodeSize -= sizeof(uint32_t);
            }
        }
    }

    /* get status */
    status = puf_makeStatus(base, kPUF_WrapGeneratedRandom);

    return status;
}

/*!
 * brief PUF Wrap user key
 *
 * The Wrap operation wraps a user defined key into a Key Code (KC).
 *
 * @param base PUF peripheral base address
 * @param keyCtx PUF key context struct.
 * @param userKey Word aligned address of input user key.
 * @param userKeySize Size of the key to be wrapped in bytes.
 * @param[out] keyCode Word aligned address of the resulting key code.
 * @param keyCodeSize Size of the output keycode in bytes.
 * @return Status of wrap operation.
 */
status_t PUF_Wrap(
    PUF_Type *base, puf_key_ctx_t *keyCtx, uint8_t *userKey, size_t userKeySize, uint8_t *keyCode, size_t keyCodeSize)
{
    uint8_t ctxIdx           = 0;
    uint32_t *userKeyAligned = NULL;
    uint32_t *keyCodeAligned = NULL;
    uint32_t context[4]      = {0};
    status_t status          = kStatus_Fail;

    /* check if WRAP is allowed */
    if (0x0u == (base->AR & PUF_AR_ALLOW_WRAP_MASK))
    {
        return kStatus_PUF_OperationNotAllowed;
    }

    /* check for valid keyCtx and keyCode pointers */
    if ((keyCtx == NULL) || (keyCode == NULL))
    {
        return kStatus_InvalidArgument;
    }

    /* check for valid userKey size. */
    /* must be 8byte multiple */
    if (userKeySize & 0x7u)
    {
        return kStatus_InvalidArgument;
    }
    /* if userKeySize > 128bytes, it must be equal to 256bytes or 384bytes or 512bytes */
    else if ((userKeySize > 128u) && !((userKeySize == 256u) || (userKeySize == 384u) || (userKeySize == 512u)))
    {
        return kStatus_InvalidArgument;
    }

    /* check that keyCodeSize is correct for given userKeySize */
    if (keyCodeSize < PUF_GET_KEY_CODE_SIZE_FOR_KEY_SIZE(userKeySize))
    {
        return kStatus_InvalidArgument;
    }

    /* only work with aligned userKey and key code */
    if ((0x3u & (uintptr_t)userKey) || (0x3u & (uintptr_t)keyCode))
    {
        return kStatus_InvalidArgument;
    }

    userKeyAligned = (uint32_t *)(uintptr_t)userKey;
    keyCodeAligned = (uint32_t *)(uintptr_t)keyCode;

    /* fill in key context */
    context[0] = PUF_KEY_OPERATION_CONTEXT_TYPE | ((userKeySize * 8u) & 0x1FFF);
    context[1] = PUF_CONTEXT_GENERIC_KEY_TYPE | (keyCtx->keyScopeStarted << 8u) | keyCtx->keyScopeEnrolled;
    context[2] = keyCtx->userCtx0;
    context[3] = keyCtx->userCtx1;

